import Foundation

//1.
//Создайте словарь в качестве ключей который содержит название стран, а в качестве значений их столицы.
//Добавьте в словарь новую пару если количество элементов в словаре меньше трех.
//Затем выведите на консоль первые три столицы
//Используйте только пройденные концепции. До циклов вы еще не дошли!
//При выведении на консоль элементов вы можете увидеть обертку Option() над вашим значением, пока пусть вас это не тревожит, точно так же как и желтые ворнинги.


//2.
//Создайте словарь с тремя фруктами, где в качестве ключа сам фрукт, а к качестве значений нули. Так же создайте массив с тремя целыми числами.
//Замените нули в словаре на значения из массива.
//Используйте только пройденные концепции. До циклов вы еще не дошли!


//3.
//Создайте множество colors, и наполните его разными цветами. Далее добавьте желтый цвет в том случае если количество элементов во множестве меньше трех.
//Выведите множество на консоль.


//4.
//Создайте множество с именами. Если окажется что множество пустое, то добавьте в него новое имя. Если же там элементов больше пяти, то удалите тот элемент, который внесет пользователь.
//Выведите на консоль список имен, через точку с запятой.


//5.
//Создайте множество целых чисел от 1 до 5. Так же создайте свойство, которое будет хранить рандомное значение от 1 до 10. Добавьте в множество это рандомное значение, если оно уже будет в множестве, то выведите на консоль сообщение: “item <…> already exists”, иначе “Item <…> added to collection”. 
