import Foundation

//1.
//Реализуйте логику светофора, если горит зеленый то на консоль выведите “Можно ехать!”, если желтый то “Приготовьтесь!”, а на красный “Стоп!”.


//2.
//Напишите программу для интернет магазина, если у пользователя есть промокод “BLACKFRIDAY” то он получает 50 процентов скидки, если у него есть промокод “CYBERMONDAY” то он получает 30 процентов скидку, во всех остальных случаях он должен заплатить полную стоимость, выведите на консоль конечную стоимость.


//3.
//Напишите программу для столовой, в которой есть два типа предоставления услуг “sit down” где ты платишь 150 рублей за человека и “buffet” 100 рублей за человека. Определите стоимость за одного человека и посчитайте общую стоимость за пришедшую компанию людей.


//4.
//Создайте алгоритм будильника, при котором в понедельник и среду вы будете отображать на консоли сообщение: “wake up at 8:30 am”, в четверг, на консоли должны видеть: “wake up at 9:00 am”, и каждую четвертую пятницу месяца на консоли должно быть: “wake up at 10:30”. А во все остальные дни: “today is a day off”.
